import React from 'react';  
import { LineChart, Line, XAxis, YAxis, CartesianGrid, Tooltip, Legend, ResponsiveContainer } from 'recharts';  

const data = [  
  {  
    "日付": "7月1日",  
    "架電件数": 20,  
    "通話件数": 5,  
    "獲得件数": 2,  
    "コンタクト率": "25.0%"  
  },  
  {  
    "日付": "7月2日",  
    "架電件数": 18,  
    "通話件数": 4,  
    "獲得件数": 1,  
    "コンタクト率": "22.2%"  
  },  
  {  
    "日付": "7月3日",  
    "架電件数": 24,  
    "通話件数": 6,  
    "獲得件数": 3,  
    "コンタクト率": "25.0%"  
  },
  {  
    "日付": "7月4日",  
    "架電件数": 22,  
    "通話件数": 6,  
    "獲得件数": 3,  
    "コンタクト率": "25.0%"  
  },
  {  
    "日付": "7月5日",  
    "架電件数": 25,  
    "通話件数": 7,  
    "獲得件数": 4,  
    "コンタクト率": "25.0%"  
  },
  {  
    "日付": "7月6日",  
    "架電件数": 20,  
    "通話件数": 5,  
    "獲得件数": 2,  
    "コンタクト率": "25.0%"  
  },
  {  
    "日付": "7月7日",  
    "架電件数": 19,  
    "通話件数": 4,  
    "獲得件数": 3,  
    "コンタクト率": "22.2%"  
  },
  {  
    "日付": "7月8日",  
    "架電件数": 24,  
    "通話件数": 6,  
    "獲得件数": 3,  
    "コンタクト率": "25.0%"  
  },
  {  
    "日付": "7月9日",  
    "架電件数": 22,  
    "通話件数": 6,  
    "獲得件数": 3,  
    "コンタクト率": "25.0%"  
  },
  {  
    "日付": "7月10日",  
    "架電件数": 25,  
    "通話件数": 7,  
    "獲得件数": 4,  
    "コンタクト率": "25.0%"  
  },
  {  
    "日付": "7月11日",
    "架電件数": 20,
    "通話件数": 5,
    "獲得件数": 2,
    "コンタクト率": "25.0%"
  },
  {  
    "日付": "7月12日",
    "架電件数": 18,
    "通話件数": 4,
    "獲得件数": 3,
    "コンタクト率": "22.2%"
  },
  {  
    "日付": "7月13日",
    "架電件数": 24,
    "通話件数": 6,
    "獲得件数": 3,
    "コンタクト率": "25.0%"
  },
  {  
    "日付": "7月14日",
    "架電件数": 22,
    "通話件数": 6,
    "獲得件数": 3,
    "コンタクト率": "25.0%"
  },
  {  
    "日付": "7月15日",
    "架電件数": 25,
    "通話件数": 7,
    "獲得件数": 4,
    "コンタクト率": "25.0%"
  },
  {  
    "日付": "7月16日",
    "架電件数": 20,
    "通話件数": 5,
    "獲得件数": 2,
    "コンタクト率": "25.0%"
  },
  {  
    "日付": "7月17日",
    "架電件数": 18,
    "通話件数": 4,
    "獲得件数": 2,
    "コンタクト率": "22.2%"
  },
  {  
    "日付": "7月18日",
    "架電件数": 24,
    "通話件数": 6,
    "獲得件数": 3,
    "コンタクト率": "25.0%"
  },
  {  
    "日付": "7月19日",
    "架電件数": 24,
    "通話件数": 6,
    "獲得件数": 4,
    "コンタクト率": "26.0%"
  },
];  

const Rechart2 = () => {  
  return (  
    <ResponsiveContainer width="100%" height={300}>  
      <LineChart  
        data={data}  
        margin={{  
          top: 5, right: 30, left: 20, bottom: 5,  
        }}  
      >  
        <CartesianGrid strokeDasharray="3 3" />  
        <XAxis dataKey="日付" />  
        <YAxis />  
        <Tooltip />  
        <Legend />  
        <Line type="monotone" dataKey="架電件数" stroke="#8884d8" />  
        <Line type="monotone" dataKey="通話件数" stroke="#82ca9d" />  
        <Line type="monotone" dataKey="獲得件数" stroke="#ffc658" />  
      </LineChart>  
    </ResponsiveContainer>  
  );  
};  

export default Rechart2;